## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                         |
|--------|-----------------------------------------------------|
| add    | `aws_iam_role.sandbox_dns_manager[0]`               |
|        | `aws_iam_role_policy.sandbox_dns_manager_policy[0]` |
| delete | `aws_iam_role.pond_dns_manager[0]`                  |
|        | `aws_iam_role_policy.pond_dns_manager_policy[0]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.pond_dns_manager[0] will be destroyed
  # (because aws_iam_role.pond_dns_manager is not in configuration)
  - resource "aws_iam_role" "pond_dns_manager" {
      - arn                   = "arn:aws:iam::239043911459:role/pond_dns_manager_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "339712868793"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-27T15:50:37Z" -> null
      - force_detach_policies = false -> null
      - id                    = "pond_dns_manager_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pond_dns_manager_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RQDNW3PIEI" -> null

      - inline_policy {
          - name   = "pond_dns_manager_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "route53:GetHostedZone",
                              - "route53:ListResourceRecordSets",
                              - "route53:ListHostedZones",
                              - "route53:ChangeResourceRecordSets",
                              - "route53:ListResourceRecordSets",
                              - "route53:GetHostedZoneCount",
                              - "route53:ListHostedZonesByName",
                              - "route53:GetChange",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.sandbox_dns_manager[0] will be created
  + resource "aws_iam_role" "sandbox_dns_manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "891376947407"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sandbox_dns_manager_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.pond_dns_manager_policy[0] will be destroyed
  # (because aws_iam_role_policy.pond_dns_manager_policy is not in configuration)
  - resource "aws_iam_role_policy" "pond_dns_manager_policy" {
      - id     = "pond_dns_manager_role:pond_dns_manager_policy" -> null
      - name   = "pond_dns_manager_policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "route53:GetHostedZone",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                          - "route53:ChangeResourceRecordSets",
                          - "route53:ListResourceRecordSets",
                          - "route53:GetHostedZoneCount",
                          - "route53:ListHostedZonesByName",
                          - "route53:GetChange",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "pond_dns_manager_role" -> null
    }

  # aws_iam_role_policy.sandbox_dns_manager_policy[0] will be created
  + resource "aws_iam_role_policy" "sandbox_dns_manager_policy" {
      + id          = (known after apply)
      + name        = "sandbox_dns_manager_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:GetHostedZone",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                          + "route53:GetHostedZoneCount",
                          + "route53:ListHostedZonesByName",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
